# CannotPaste Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DecalFailures..::..CannotPaste Property
BuiltInFailures..::..DecalFailures Class See Also
---
Can't place Decal at new position.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPaste { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPaste As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPaste {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DecalFailures Class
Autodesk.Revit.DB Namespace